In [19]:
import pandas as pd
import numpy as np

In [3]:
data = pd.DataFrame({'group':['a','b','c','a','b','c','a','b','c',],
                    'data':[4,3,2,1,5,6,9,8,7,]})
data

  group  data
0     a     4
1     b     3
2     c     2
3     a     1
4     b     5
5     c     6
6     a     9
7     b     8
8     c     7

In [4]:
data.sort_values(by=['group','data'],ascending=[False,True],inplace=True)
data

  group  data
2     c     2
5     c     6
8     c     7
1     b     3
4     b     5
7     b     8
3     a     1
0     a     4
6     a     9

In [5]:
data = pd.DataFrame({'k1':['one']*3+['two']*4,
                    'k2':[3,2,1,3,3,4,4]})
data

    k1  k2
0  one   3
1  one   2
2  one   1
3  two   3
4  two   3
5  two   4
6  two   4

In [6]:
data.sort_values(by='k2',inplace=True)
data

    k1  k2
2  one   1
1  one   2
0  one   3
3  two   3
4  two   3
5  two   4
6  two   4

In [7]:
data.drop_duplicates() # same value in same row

    k1  k2
2  one   1
1  one   2
0  one   3
3  two   3
5  two   4

In [8]:
data.drop_duplicates(subset='k1')

    k1  k2
2  one   1
3  two   3

In [18]:
data = pd.DataFrame({'food':['a1','a2','b1','b2','c1','c2','c3',],
                'data':[1,2,3,4,5,6,7]})
data

  food  data
0   a1     1
1   a2     2
2   b1     3
3   b2     4
4   c1     5
5   c2     6
6   c3     7

In [13]:
def food_map(food):
    if 'a' in food:
        return 'a'
    elif 'b' in food:
        return 'b'
    elif 'c' in food:
        return 'c'
data['food_map'] = data['food'].map(food_map)
data

  food  data food_map
0   a1     1        a
1   a2     2        a
2   b1     3        b
3   b2     4        b
4   c1     5        c
5   c2     6        c
6   c3     7        c

In [24]:
df = pd.DataFrame({'data1':np.random.randint(3,5,5),
                'data2':np.random.randint(3,5,5)})
df

   data1  data2
0      4      3
1      4      4
2      3      3
3      4      3
4      3      3

In [28]:
df2 = df.assign(ration=df['data1']/df['data2']) # add col
df2

   data1  data2    ration
0      4      3  1.333333
1      4      4  1.000000
2      3      3  1.000000
3      4      3  1.333333
4      3      3  1.000000

In [29]:
df2.drop('ration',axis='columns',inplace=True)
df2

   data1  data2
0      4      3
1      4      4
2      3      3
3      4      3
4      3      3

In [30]:
data = pd.Series(np.arange(10))
data

0    0
1    1
2    2
3    3
4    4
5    5
6    6
7    7
8    8
9    9
dtype: int32

In [31]:
data.replace(8,100,inplace=True)
data

0      0
1      1
2      2
3      3
4      4
5      5
6      6
7      7
8    100
9      9
dtype: int32

In [39]:
ages = np.arange(50,60)
bins = [40,54,57,60]
bins_res = pd.cut(ages,bins)
print(ages)
bins_res

[50 51 52 53 54 55 56 57 58 59]

[(40, 54], (40, 54], (40, 54], (40, 54], (40, 54], (54, 57], (54, 57], (54, 57], (57, 60], (57, 60]]
Categories (3, interval[int64, right]): [(40, 54] < (54, 57] < (57, 60]]

In [40]:
bins_res.codes # where slot

array([0, 0, 0, 0, 0, 1, 1, 1, 2, 2], dtype=int8)

In [41]:
pd.value_counts(bins_res)

(40, 54]    5
(54, 57]    3
(57, 60]    2
dtype: int64

In [42]:
pd.cut(ages,[45,55,60])

[(45, 55], (45, 55], (45, 55], (45, 55], (45, 55], (45, 55], (55, 60], (55, 60], (55, 60], (55, 60]]
Categories (2, interval[int64, right]): [(45, 55] < (55, 60]]

In [46]:
group_name = ['a','b',]
pd.value_counts(pd.cut(ages,[45,55,60],labels=group_name)) #labes name slot

a    6
b    4
dtype: int64

In [54]:
df = pd.DataFrame([np.arange(3),[0,np.nan,0],[0,0,np.nan],np.arange(3)])
df

   0    1    2
0  0  1.0  2.0
1  0  NaN  0.0
2  0  0.0  NaN
3  0  1.0  2.0

In [55]:
df.isnull()

       0      1      2
0  False  False  False
1  False   True  False
2  False  False   True
3  False  False  False

In [58]:
df.notna()

      0      1      2
0  True   True   True
1  True  False   True
2  True   True  False
3  True   True   True

In [60]:
df.isnull().any(axis=1)

0    False
1     True
2     True
3    False
dtype: bool

In [62]:
df.fillna(5)

   0    1    2
0  0  1.0  2.0
1  0  5.0  0.0
2  0  0.0  5.0
3  0  1.0  2.0

In [63]:
df[df.isnull().any(axis=1)]

   0    1    2
1  0  NaN  0.0
2  0  0.0  NaN